app/controllers/categories_controller.rb

  def index
    @categories = Category.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])
---
SELECT "categories".* FROM "categories" ORDER BY topic desc LIMIT 5 OFFSET 0

  def show
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "place", "created_at", "updated_at", "topic") VALUES ('mais otra', 't', '2011-05-11 16:20:55.246406', '2011-05-11 16:20:55.246406', 'f')